app/views/survey/display_responses.html.erb

      <td><%=num%></td>
      <td><%=(SurveySet.find((Que.find(response.Que_id)).SurveySet_id)).name%></td>
---
SELECT  "ques".* FROM "ques" WHERE "ques"."id" = ? LIMIT 1  [["id", 7]]
SELECT  "survey_sets".* FROM "survey_sets" WHERE "survey_sets"."id" = ? LIMIT 1  [["id", 20]]

        <td><%=response.response%></td>
        <td><%=(User.find(response.User_id )).name%></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", nil]]