app/controllers/users_controller.rb

	def edit
		if !correct_user && !admin_user
			flash[:danger] = "You don't have permission to access the requested url"
			render 'index'
		else
			@user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

	def update
		@user = User.find(params[:id])
		if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "abhijith"], ["password_digest", "$2a$10$ZpMUG1Qyvjt.gHhe50MPGO9ITK3CwR7FZNOom70NZWsRvr/P60rne"], ["updated_at", "2016-09-13 14:22:42.455434"], ["id", 1]]